package com.zm.supplier.util;

import java.util.HashMap;
import java.util.Map;

public class UnitCode {
	private static final Map<String, String> unitCode = new HashMap<String, String>() {
		/**  
		 * serialVersionUID:TODO(用一句话描述这个变量表示什么).  
		 * @since JDK 1.7  
		 */
		private static final long serialVersionUID = 1L;

		{
			put("台","001");
			put("座","002");
			put("辆","003");
			put("艘","004");
			put("架","005");
			put("套","006");
			put("个","007");
			put("只","008");
			put("头","009");
			put("张","010");
			put("件","011");
			put("支","012");
			put("枝","013");
			put("根","014");
			put("条","015");
			put("把","016");
			put("块","017");
			put("卷","018");
			put("副","019");
			put("片","020");
			put("组","021");
			put("份","022");
			put("幅","023");
			put("双","025");
			put("对","026");
			put("棵","027");
			put("株","028");
			put("井","029");
			put("米","030");
			put("盘","031");
			put("平方米","032");
			put("立方米","033");
			put("筒","034");
			put("千克","035");
			put("克","036");
			put("盆","037");
			put("万个","038");
			put("具","039");
			put("百副","040");
			put("百支","041");
			put("百把","042");
			put("百个","043");
			put("百片","044");
			put("刀","045");
			put("疋","046");
			put("公担","047");
			put("扇","048");
			put("百枝","049");
			put("千只","050");
			put("千块","051");
			put("千盒","052");
			put("千枝","053");
			put("千个","054");
			put("亿支","055");
			put("亿个","056");
			put("万套","057");
			put("千张","058");
			put("万张","059");
			put("千伏安","060");
			put("千瓦","061");
			put("千瓦时","062");
			put("千升","063");
			put("英尺","067");
			put("吨","070");
			put("长吨","071");
			put("短吨","072");
			put("司马担","073");
			put("司马斤","074");
			put("斤","075");
			put("磅","076");
			put("担","077");
			put("英担","078");
			put("短担","079");
			put("两","080");
			put("市担","081");
			put("盎司","083");
			put("克拉","084");
			put("市尺","085");
			put("码","086");
			put("英寸","088");
			put("寸","089");
			put("升","095");
			put("毫升","096");
			put("英加仑","097");
			put("美加仑","098");
			put("立方英尺","099");
			put("立方尺","101");
			put("平方码","110");
			put("平方英尺","111");
			put("平方尺","112");
			put("英制马力","115");
			put("公制马力","116");
			put("令","118");
			put("箱","120");
			put("批","121");
			put("罐","122");
			put("桶","123");
			put("扎","124");
			put("包","125");
			put("箩","126");
			put("打","127");
			put("筐","128");
			put("罗","129");
			put("匹","130");
			put("册","131");
			put("本","132");
			put("发","133");
			put("枚","134");
			put("捆","135");
			put("袋","136");
			put("粒","139");
			put("盒","140");
			put("合","141");
			put("瓶","142");
			put("千支","143");
			put("万双","144");
			put("万粒","145");
			put("千粒","146");
			put("千米","147");
			put("千英尺","148");
			put("部","163");
		}
	};

	/**
	 * 通过返回码获取返回信息
	 * 
	 * @param errCode
	 *            错误码
	 * @return {String}
	 */
	public static String get(String code) {
		return unitCode.get(code);
	}
}
